inputs/templates/openfoam/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            -0.9;

seaLevelAsReference true;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            irregular;
    spectrum            JONSWAP;
    N                   200;
    Tsoft               24;
    Hs                  5.8;
    Tp                  12;
    gamma               3.3;
    depth               14.1;
    direction           ( 1 0 0 );
    spectramValues  nonuniform List<scalar> 
201
(
2.13757e-40
3.92739e-33
2.40388e-27
1.07608e-22
6.31464e-19
7.52866e-16
2.5432e-13
3.14086e-11
...
)
;

    fspectrum       nonuniform List<scalar> 
201
(
0.0277778
0.0290802
0.0303818
0.031682
0.0329801
0.0342753
0.035567
0.0368543
...
)
;

    amplitude           nonuniform List<scalar>
    200
    (
        2.26161e-18
        1.7689e-15
        3.74055e-13
        2.86326e-11
        9.87896e-10
        1.81511e-08
        2.01895e-07
        1.50179e-06
...
    );
    frequency           nonuniform List<scalar>
    200
    (
        0.028429
        0.029731
        0.0310319
        0.0323311
        0.0336277
        0.0349211
        0.0362106
        0.0374955
...
    );
    phaselag            nonuniform List<scalar>
    200
    (
        1.12089
        2.51125
        1.04677
        1.3328
        0.389154
        0.340234
        1.73206
        0.300068
...
    );
    waveNumber          nonuniform List<vector>
    200
    (
        (0.0153049 0 0)
        (0.0160175 0 0)
        (0.016731 0 0)
        (0.0174451 0 0)
        (0.0181596 0 0)
        (0.0188742 0 0)
        (0.0195883 0 0)
        (0.0203018 0 0)
...
    );

    frequencyAxis
    {
        discretisation      cosineStretchedFrequencyAxis;
        lowerFrequencyCutoff 0.0277778;
        upperFrequencyCutoff 0.25;
        writeSpectrum       true;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 -1 );
        endX                ( 400 0 1 );
        orientation         ( 1 0 0 );
        fieldNames          ( alpha.water U p_rgh);
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               24;
}



// ************************************************************************* //
